// for문을 사용하여 0부터 10미만의 정수 중에서 짝수만을 작은 수부터 출력하시오.
for (var i = 0; i < 10; i++) {
    if(i%2==0)
    console.log(i);
}
// for문을 사용하여 0부터 10미만의 정수 중에서 홀수만을 작은 수부터 출력하시오.
for (var i = 0; i < 10; i++) {
    if (i % 2 == 1)
        console.log(i);
}
// for문을 사용하여 0부터 10미만의 정수 중에서 홀수만을 큰 수부터 출력하시오.
for (var i = 10; i > 0; i--) {
    if (i % 2 == 1)
        console.log(i);
}
// while문을 사용하여 0부터 10까지 정수 중에서 짝수만을 작은 수부터 출력하시오.

var i = 0;

while (i < 10) {
    i++;
    if (i % 2 == 0);
    console.log(i);
}

// while문을 사용하여 0부터 10까지 정수 중에서 홀수만을 작은 수부터 출력하시오.
